PietroMezzaroba/meshtastic-xiao-esp32c6-sx1262/src/mesh/RadioInterface.cpp
void RadioInterface::clampConfigLora(meshtastic_Config_LoRaConfig &loraConfig)
{
    checkOrClampConfigLora(loraConfig, true);
}

/**
 * Pull our channel settings etc... from protobufs to the dumb interface settings
 * Note: this must be given only settings which have been validated or clamped!
 */
void RadioInterface::applyModemConfig()
{
    // Set up default configuration
    // No Sync Words in LORA mode
    meshtastic_Config_LoRaConfig &loraConfig = config.lora;
    const RegionInfo *newRegion = getRegion(loraConfig.region);
    myRegion = newRegion;

    if (loraConfig.use_preset) {
        if (!validateConfigLora(loraConfig)) {
            loraConfig.modem_preset = newRegion->getDefaultPreset();
        }
        uint8_t newcr;
        modemPresetToParams(loraConfig.modem_preset, newRegion->wideLora, bw, sf, newcr);
        // If custom CR is being used already, check if the new preset is higher
        if (loraConfig.coding_rate >= 5 && loraConfig.coding_rate <= 8 && loraConfig.coding_rate < newcr) {
            cr = newcr;
            LOG_INFO("Default Coding Rate is higher than custom setting, using %u", cr);
        }
        // If the custom CR is higher than the preset, use it
        else if (loraConfig.coding_rate >= 5 && loraConfig.coding_rate <= 8 && loraConfig.coding_rate > newcr) {
            cr = loraConfig.coding_rate;
            LOG_INFO("Using custom Coding Rate %u", cr);
        } else {
            cr = newcr;
        }

    } else { // if not using preset, then just use the custom settings
        if (validateConfigLora(loraConfig)) {
        } else {
            LOG_WARN("Invalid LoRa config settings, cannot apply requested modem config - falling back to %s defaults",
                     newRegion->name);
            clampConfigLora(loraConfig);
        }
        bw = bwCodeToKHz(loraConfig.bandwidth);
        sf = loraConfig.spread_factor;
        cr = loraConfig.coding_rate;
    }

    power = loraConfig.tx_power;

    if ((power == 0) || ((power > newRegion->powerLimit) && !devicestate.owner.is_licensed))
        power = newRegion->powerLimit;

    if (power == 0)
        power = 17; // Default to this power level if we don't have a valid regional power limit (powerLimit of newRegion defaults
                    // to 0, currently no region has an actual power limit of 0 [dBm] so we can assume regions which have this
                    // variable set to 0 don't have a valid power limit)

    // Set final tx_power back onto config
    loraConfig.tx_power = (int8_t)power; // cppcheck-suppress assignmentAddressToInteger

    uint32_t channel_num;
    float freq;

    // Calculate number of frequency slots (aka Channels):
    // spacing = gap between channels (0 for continuous spectrum) and at the beginning of the band
    // padding = gap at the beginning and end of the channel (0 for no padding)
    float freqSlotWidth = newRegion->profile->spacing + (newRegion->profile->padding * 2) + (bw / 1000); // in MHz
    uint32_t numFreqSlots = round((newRegion->freqEnd - newRegion->freqStart + newRegion->profile->spacing) / freqSlotWidth);

    // Calculate hash of channel name and preset name to pick a default frequency slot if user has not specified one.
    // Note that channel_num is actually (channel_num - 1), i.e. zero-based, since modulus (%) returns values from 0 to
    // (numFreqSlots - 1).
    const char *channelName = channels.getName(channels.getPrimaryIndex());
    uint32_t channelNameHashSlot = hash(channelName) % numFreqSlots;
    uint32_t presetNameHashSlot =
        hash(DisplayFormatters::getModemPresetDisplayName(loraConfig.modem_preset, false, loraConfig.use_preset)) % numFreqSlots;

    // override if we have a verbatim frequency
    if (loraConfig.override_frequency) {
        freq = loraConfig.override_frequency;
        channel_num = -1;
        uses_default_frequency_slot = false;
    } else {

        // If user has not manually specified a frequency slot, or has not specified one that is different than the default or the
        // override for the new region, then use the default or override. If the user has not specified one, but has specified a
        // custom channel name, then use the hash of that channel name to pick a frequency slot. Note that channel_num is actually
        // (channel_num - 1), i.e. zero-based, since modulus (%) returns values from 0 to (numFreqSlots - 1).
        // NB: channel_num is also know as frequency slot but it's too late to fix now.
        if (uses_default_frequency_slot) {
            // Handle three override slot cases: explicit slot (>0), preset hash (-1), or channel hash (0)
            if (newRegion->overrideSlot > 0) {
                channel_num = newRegion->overrideSlot - 1; // explicit override slot (1-based to 0-based)
            } else if (newRegion->overrideSlot == OVERRIDE_SLOT_PRESET_HASH) {
                channel_num = presetNameHashSlot; // use preset name hash
            } else {
                channel_num = channelNameHashSlot; // use channel name hash (default case)
            }
        } else { // use the manually defined one
            channel_num = loraConfig.channel_num - 1;
        }

        // Calculate frequency: freqStart is band edge, add half bandwidth (plus optional padding) to get middle of first channel
        // subsequent channels are spaced by freqSlotWidth
        freq = newRegion->freqStart + (bw / 2000) + newRegion->profile->padding + (channel_num * freqSlotWidth); // in MHz
    }

    saveChannelNum(channel_num);
    saveFreq(freq + loraConfig.frequency_offset);

    if (newRegion->wideLora) {                          // clamp if wide freq range
        preambleLength = wideLoraPreambleLengthDefault; // 12 is the default for operation above 2GHz
    } else {
        preambleLength =
            preambleLengthDefault; // 8 is default, but we use longer to increase the amount of sleep time when receiving
    }

    slotTimeMsec = computeSlotTimeMsec();
    preambleTimeMsec = preambleLength * (pow_of_2(sf) / bw);

    LOG_INFO("Radio freq=%.3f, config.lora.frequency_offset=%.3f", freq, loraConfig.frequency_offset);
    LOG_INFO("Set radio: region=%s, name=%s, config=%u, ch=%d, power=%d", newRegion->name, channelName, loraConfig.modem_preset,
             channel_num, power);
    LOG_INFO("newRegion->freqStart -> newRegion->freqEnd: %f -> %f (%f MHz)", newRegion->freqStart, newRegion->freqEnd,
             newRegion->freqEnd - newRegion->freqStart);
    LOG_INFO("numFreqSlots: %u x %.3fkHz", numFreqSlots, bw);
    if (newRegion->overrideSlot > 0) {
        LOG_INFO("Using region explicit override slot: %d", newRegion->overrideSlot);
    } else if (newRegion->overrideSlot == OVERRIDE_SLOT_PRESET_HASH) {
        LOG_INFO("Using region preset name hash for slot selection");
    }
    LOG_INFO("channel_num: %d", channel_num + 1);
    LOG_INFO("frequency: %f", getFreq());
    LOG_INFO("Slot time: %u msec, preamble time: %u msec", slotTimeMsec, preambleTimeMsec);
} // end of applyModemConfig

